Процедура ПровестиТестирование()
	
	КаталогПроекта = ОбъединитьПути(ТекущийСценарий().Каталог, "..");

	Программа  = "oscript";
	//Библиотека = ОбъединитьПути(КаталогПроекта, "oscript_modules");
	
	 Библиотека = ПолучитьЗначениеСистемнойНастройки("lib.system");
    
	ЮнитТестер = ОбъединитьПути(Библиотека, "1testrunner", "testrunner.os");

	КаталогТестов = Новый Файл(ОбъединитьПути(КаталогПроекта, "tests"));
			
	Если КаталогТестов.Существует() и КаталогТестов.ЭтоКаталог() Тогда
			
			КаталогТестовПакета = Новый Файл(ОбъединитьПути(КаталогПроекта,"test-reports"));
			Если Не КаталогТестовПакета.Существует() Тогда
				СоздатьКаталог(КаталогТестовПакета.ПолноеИмя);
			КонецЕсли;

			ФайлТестовПакета = Новый Файл(ОбъединитьПути(КаталогПроекта,"test-reports" , "tests.xml"));
			Если ФайлТестовПакета.Существует() Тогда
				Сообщить("Удаляю старый отчет о тестировании: " + ФайлТестовПакета.ПолноеИмя);
				УдалитьФайлы(ФайлТестовПакета.ПолноеИмя);
			КонецЕсли;
			
			Сообщить("Каталог тестов найден");
			
			СтрокаЗапуска = Программа + " """ + ЮнитТестер + """ -runall """ + КаталогТестов.ПолноеИмя + """ xddReportPath ../test-reports/";
			Сообщить("Запускаю: " + СтрокаЗапуска);
			
			Процесс = СоздатьПроцесс(СтрокаЗапуска, КаталогТестов.ПолноеИмя, Истина);
			Процесс.Запустить();
			Пока Не Процесс.Завершен Цикл
				Сообщить(Процесс.ПотокВывода.ПрочитатьСтроку());
			КонецЦикла;
			
			Сообщить(Процесс.ПотокВывода.Прочитать());
			
			Сообщить("Тестирование закончено");
			
	КонецЕсли;

КонецПроцедуры


ПровестиТестирование();
